Repository: harrysxu/MigraineNoteIOS
Catalog: migraine_note/migraine_note/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# report.label.medicationDays
source: Medication days：
zh_hans: 用药天数：
zh_hant: 用藥天數：

# report.label.statisticsDays
source: Statistics days：
zh_hans: 统计天数：
zh_hant: 統計天數：

# report.label.missedDays
source: Missed days：
zh_hans: 遗漏天数：
zh_hant: 遺漏天數：

# report.label.adherenceRate
source: Adherence rate：
zh_hans: 依从率：
zh_hant: 依從率：

# report.label.totalTreatments
source: Total treatments：
zh_hans: 总治疗次数：
zh_hant: 總治療次數：

# report.label.avgTreatmentDuration
source: Average treatment duration：
zh_hans: 平均治疗时长：
zh_hant: 平均治療時長：

# report.label.auraTypeDistribution
source: Aura type distribution：
zh_hans: 先兆类型分布：
zh_hant: 先兆類型分佈：

# report.label.medicationCategoryBreakdown
source: Medication category breakdown：
zh_hans: 药物分类统计：
zh_hant: 藥物分類統計：

# report.label.topMedications
source: Top medications：
zh_hans: 常用药物排名：
zh_hant: 常用藥物排名：

# report.label.treatmentTypeDistribution
source: Treatment type distribution：
zh_hans: 治疗类型分布：
zh_hant: 治療類型分佈：

# report.label.mild
source: Mild (1-3)：
zh_hans: 轻度 (1-3)：
zh_hant: 輕度 (1-3)：

# report.label.moderate
source: Moderate (4-6)：
zh_hans: 中度 (4-6)：
zh_hant: 中度 (4-6)：

# report.label.severe
source: Severe (7-10)：
zh_hans: 重度 (7-10)：
zh_hant: 重度 (7-10)：

# report.table.date
source: Date
zh_hans: 日期
zh_hant: 日期

# report.table.duration
source: Duration
zh_hans: 时长
zh_hant: 時長

# report.table.intensity
source: Intensity
zh_hans: 强度
zh_hant: 強度

# report.table.location
source: Location
zh_hans: 部位
zh_hant: 部位

# report.table.mainTriggers
source: Main triggers
zh_hans: 主要诱因
zh_hant: 主要誘因

# report.table.medication
source: Medication
zh_hans: 用药
zh_hant: 用藥

# report.table.effectiveness
source: Effectiveness
zh_hans: 疗效
zh_hant: 療效

# report.table.type
source: Type
zh_hans: 类型
zh_hant: 類型

# report.table.content
source: Content
zh_hans: 内容
zh_hant: 內容

# report.table.detail
source: Detail
zh_hans: 详情
zh_hant: 詳情

# report.table.notes
source: Notes
zh_hans: 备注
zh_hant: 備註

# report.info.notFilled
source: Not filled
zh_hans: 未填写
zh_hant: 未填寫

# report.info.unspecified
source: Unspecified
zh_hans: 未指定
zh_hant: 未指定

# report.info.familyHistoryYes
source: Family history of migraine
zh_hans: 有偏头痛家族史
zh_hant: 有偏頭痛家族史

# report.info.inProgress
source: In progress
zh_hans: 进行中
zh_hant: 進行中

# report.info.noData
source: No data
zh_hans: 暂无数据
zh_hant: 暫無數據

# report.info.tcmTreatment
source: TCM treatment
zh_hans: 中医治疗
zh_hant: 中醫治療

# report.info.surgery
source: Surgery
zh_hans: 手术
zh_hant: 手術

# report.risk.none
source: No risk
zh_hans: 无风险
zh_hant: 無風險

# report.risk.low
source: Low risk
zh_hans: 低风险
zh_hant: 低風險

# report.risk.medium
source: Medium risk ⚠️
zh_hans: 中风险 ⚠️
zh_hant: 中風險 ⚠️

# report.risk.high
source: High risk ⚠️
zh_hans: 高风险 ⚠️
zh_hant: 高風險 ⚠️

# report.moh.advice
source: Recommendation: Please consult your doctor and consider preventive treatment to avoid acute medication overuse.
zh_hans: 建议：请咨询医生，考虑预防性治疗方案，避免急性用药过度使用。
zh_hant: 建議：請諮詢醫生，考慮預防性治療方案，避免急性用藥過度使用。

# report.moh.note
source: Note: MOH assessment requires complete monthly data (28-31 days)
zh_hans: 注：MOH评估需要完整的月度数据（28-31天）
zh_hant: 註：MOH評估需要完整的月度數據（28-31天）

# report.chronic.warning
source: ⚠️ Meets chronic migraine criteria (≥15 days/month)
zh_hans: ⚠️ 符合慢性偏头痛诊断标准（≥15天/月）
zh_hant: ⚠️ 符合慢性偏頭痛診斷標準（≥15天/月）

# report.footer.generated
source: Generated: %@
zh_hans: 生成时间：%@
zh_hant: 生成時間：%@

# report.footer.page
source: Page %d
zh_hans: 第 %d 页
zh_hant: 第 %d 頁

# report.footer.disclaimer
source: This report is for reference only and does not constitute medical advice. Please consult a qualified healthcare professional for diagnosis and treatment.
zh_hans: 本报告仅供参考，不构成医疗建议。请咨询专业医生进行诊断和治疗。
zh_hant: 本報告僅供參考，不構成醫療建議。請諮詢專業醫生進行診斷和治療。

# report.format.age
source: %d years
zh_hans: %d岁
zh_hant: %d歲

# report.format.historyYears
source: %d years (%d years at onset)
zh_hans: %d年（%d岁首发）
zh_hant: %d年（%d歲首發）

# report.format.height
source: Height %@ cm
zh_hans: 身高 %@cm
zh_hant: 身高 %@cm

# report.format.weight
source: Weight %@ kg
zh_hans: 体重 %@kg
zh_hant: 體重 %@kg

# report.format.duration.hoursMinutes
source: %d hours %d minutes
zh_hans: %d小时%d分钟
zh_hant: %d小時%d分鐘

# report.format.duration.minutesOnly
source: %d minutes
zh_hans: %d分钟
zh_hant: %d分鐘

# report.format.count
source: %d times
zh_hans: %d次
zh_hant: %d次

# report.format.days
source: %d days
zh_hans: %d天
zh_hant: %d天

# report.format.hours
source: %.1f hours
zh_hans: %.1f小时
zh_hant: %.1f小時

# report.format.minutes
source: %d minutes
zh_hans: %d分钟
zh_hant: %d分鐘

# report.format.nsaidThreshold
source: %d days (threshold: ≥15 days)
zh_hans: %d天 (阈值: ≥15天)
zh_hant: %d天 (閾值: ≥15天)

# report.format.triptanOpioidThreshold
source: %d days (threshold: ≥10 days)
zh_hans: %d天 (阈值: ≥10天)
zh_hant: %d天 (閾值: ≥10天)

# report.chart.axis.month
source: Month
zh_hans: 月份
zh_hant: 月份

# report.chart.axis.attackDays
source: Attack days
zh_hans: 发作天数
zh_hant: 發作天數

# report.chart.axis.hour
source: Hour
zh_hans: 小时
zh_hant: 小時

# report.chart.axis.count
source: Count
zh_hans: 次数
zh_hant: 次數

# report.chart.axis.timeHours
source: Time (hours)
zh_hans: 时间（小时）
zh_hant: 時間（小時）

# report.chart.axis.weekday
source: Weekday
zh_hans: 星期
zh_hant: 星期

# report.chart.axis.level
source: Level
zh_hans: 级别
zh_hant: 級別

# report.chart.intensity.mild
source: Mild(1-3)
zh_hans: 轻度(1-3)
zh_hant: 輕度(1-3)

# report.chart.intensity.moderate
source: Moderate(4-6)
zh_hans: 中度(4-6)
zh_hant: 中度(4-6)

# report.chart.intensity.severe
source: Severe(7-10)
zh_hans: 重度(7-10)
zh_hant: 重度(7-10)

# report.subtitle
source: Headache Medical Report
zh_hans: 头痛医疗报告
zh_hant: 頭痛醫療報告

# report.format.periodRange
source: %@ to %@
zh_hans: %@ 至 %@
zh_hant: %@ 至 %@

# stats.streak.days
source: Pain-Free Days
zh_hans: 无头痛天数
zh_hant: 無頭痛天數

# stats.monthly.attacks
source: Monthly Attacks
zh_hans: 本月发作
zh_hant: 本月發作

# stats.average.intensity
source: Average Intensity
zh_hans: 平均强度
zh_hant: 平均強度

# settings.title
source: Settings
zh_hans: 设置
zh_hant: 設置

# settings.theme
source: Theme
zh_hans: 主题设置
zh_hant: 主題設置

# settings.location
source: Location Services
zh_hans: 位置服务
zh_hant: 位置服務

# settings.icloud
source: iCloud Sync
zh_hans: iCloud 同步
zh_hant: iCloud 同步

# settings.labels
source: Label Management
zh_hans: 标签管理
zh_hant: 標籤管理

# settings.about
source: About
zh_hans: 关于
zh_hant: 關於

# time.hour
source: Hour
zh_hans: 小时
zh_hant: 小時

# time.minute
source: Minute
zh_hans: 分钟
zh_hant: 分鐘

# time.day
source: Day
zh_hans: 天
zh_hant: 天

# empty.records.title
source: No Records
zh_hans: 暂无记录
zh_hant: 暫無記錄

# empty.records.subtitle
source: Start recording your first migraine attack
zh_hans: 开始记录您的第一次偏头痛发作
zh_hant: 開始記錄您的第一次偏頭痛發作

# empty.search.result
source: No matching records
zh_hans: 没有匹配的记录
zh_hant: 沒有匹配的記錄

# action.quick.start
source: Quick Start
zh_hans: 快速开始
zh_hant: 快速開始

# action.quick.end
source: Quick End
zh_hans: 快速结束
zh_hant: 快速結束

# action.health.event
source: Health Event
zh_hans: 健康事件
zh_hant: 健康事件

# action.view.all
source: View All
zh_hans: 查看全部
zh_hant: 查看全部

# action.retry
source: Retry
zh_hans: 重试
zh_hant: 重試

# action.refresh
source: Refresh
zh_hans: 刷新
zh_hant: 刷新

# action.manage
source: Manage
zh_hans: 管理
zh_hant: 管理

# action.custom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# encourage.streak.30days
source: Amazing! One month pain-free 🎉
zh_hans: 太棒了！坚持一个月无头痛 🎉
zh_hant: 太棒了！堅持一個月無頭痛 🎉

# encourage.streak.7days
source: Great! One week pain-free ✨
zh_hans: 很好！已经一周没有头痛了 ✨
zh_hant: 很好！已經一週沒有頭痛了 ✨

# encourage.continue
source: Keep it up, you're doing great 💪
zh_hans: 继续保持，你做得很好 💪
zh_hant: 繼續保持，你做得很好 💪

# encourage.first.step
source: Recording is the first step to improvement 🌱
zh_hans: 开始记录是改善的第一步 🌱
zh_hant: 開始記錄是改善的第一步 🌱

# encourage.week.success
source: Great week, keep going ⭐️
zh_hans: 这周表现不错，值得鼓励 ⭐️
zh_hant: 這週表現不錯，值得鼓勵 ⭐️

# encourage.improvement
source: Fewer attacks than last month 📈
zh_hans: 相比上月，发作次数减少了 📈
zh_hant: 相比上月，發作次數減少了 📈

# home.greeting
source: How are you feeling today?
zh_hans: 今天感觉如何？
zh_hant: 今天感覺如何？

# home.recent.records
source: Recent Records
zh_hans: 最近记录
zh_hant: 最近記錄

# home.monthly.overview
source: Monthly Overview
zh_hans: 本月概况
zh_hant: 本月概況

# home.calendar
source: Calendar
zh_hans: 日历
zh_hant: 日曆

# status.ongoing
source: Ongoing Attack
zh_hans: 发作进行中
zh_hant: 發作進行中

# status.pain.free
source: Pain-Free
zh_hans: 无头痛
zh_hant: 無頭痛

# status.discover.patterns
source: Discover health patterns
zh_hans: 发现健康规律
zh_hant: 發現健康規律

# weather.current
source: Current Weather
zh_hans: 当前天气
zh_hant: 當前天氣

# weather.loading
source: Fetching weather data...
zh_hans: 正在获取天气数据...
zh_hant: 正在獲取天氣數據...

# weather.unavailable
source: Weather data unavailable
zh_hans: 天气数据不可用
zh_hant: 天氣數據不可用

# weather.no.location
source: Unable to get location
zh_hans: 无法获取位置
zh_hant: 無法獲取位置

# weather.permission.needed
source: Location permission required for weather data
zh_hans: 需要定位权限以获取天气数据
zh_hant: 需要定位權限以獲取天氣數據

# weather.go.settings
source: Go to Settings
zh_hans: 前往设置开启定位
zh_hant: 前往設定開啟定位

source: Weather Info
zh_hans: 天气信息
zh_hant: 天氣信息

# weather.temperature
source: Temperature
zh_hans: 温度
zh_hant: 溫度

# weather.pressure
source: Pressure
zh_hans: 气压
zh_hant: 氣壓

# weather.humidity
source: Humidity
zh_hans: 湿度
zh_hant: 濕度

# weather.wind.speed
source: Wind Speed
zh_hans: 风速
zh_hant: 風速

# weather.condition
source: Condition
zh_hans: 天气状况
zh_hant: 天氣狀況

# weather.location
source: Location (optional)
zh_hans: 位置（可选）
zh_hant: 位置（可選）

# weather.manually.edited
source: Manually edited
zh_hans: 已手动编辑
zh_hant: 已手動編輯

# weather.time.changed.warning
source: Start time changed, refresh weather recommended
zh_hans: 开始时间已改变，建议刷新天气
zh_hant: 開始時間已改變，建議刷新天氣

# weather.no.data
source: No associated weather data
zh_hans: 未关联天气数据
zh_hant: 未關聯天氣數據

# weather.fetch
source: Get Weather
zh_hans: 获取天气
zh_hant: 獲取天氣

# weather.attribution
source: Weather data by Apple Weather
zh_hans: 天气数据由 Apple Weather 提供
zh_hant: 天氣數據由 Apple Weather 提供

# form.pain.assessment
source: Pain Assessment
zh_hans: 疼痛评估
zh_hant: 疼痛評估

# form.pain.location
source: Pain Location
zh_hans: 疼痛部位
zh_hant: 疼痛部位

# form.pain.quality
source: Pain Quality
zh_hans: 疼痛性质
zh_hant: 疼痛性質

# form.pain.intensity
source: Intensity
zh_hans: 强度
zh_hant: 強度

# form.symptoms
source: Symptoms
zh_hans: 伴随症状
zh_hant: 伴隨症狀

# form.symptoms.tcm
source: TCM Symptoms
zh_hans: 中医症状
zh_hant: 中醫症狀

# form.triggers
source: Triggers
zh_hans: 诱因分析
zh_hant: 誘因分析

# form.medications
source: Medications
zh_hans: 用药记录
zh_hant: 用藥記錄

# form.interventions
source: Non-Pharmacological Interventions
zh_hans: 非药物干预
zh_hant: 非藥物干預

# form.notes
source: Notes
zh_hans: 备注
zh_hant: 備註

# form.start.time
source: Start Time
zh_hans: 开始时间
zh_hant: 開始時間

# form.end.time
source: End Time
zh_hans: 结束时间
zh_hant: 結束時間

# form.has.aura
source: Has Aura?
zh_hans: 是否有先兆？
zh_hant: 是否有先兆？

# form.add.medication
source: Add Medication
zh_hans: 添加用药
zh_hant: 添加用藥

# form.no.medication
source: No medication recorded
zh_hans: 未记录用药
zh_hant: 未記錄用藥

# form.record.title
source: Record Migraine Attack
zh_hans: 记录偏头痛发作
zh_hant: 記錄偏頭痛發作

# form.all.optional
source: All fields optional, save anytime
zh_hans: 所有字段均可选，随时保存
zh_hant: 所有字段均可選，隨時保存

# form.fill.suggestion
source: Suggest filling pain intensity and location for accurate analysis
zh_hans: 建议填写疼痛强度和部位以获得更准确的分析
zh_hant: 建議填寫疼痛強度和部位以獲得更準確的分析

# status.ongoing.duration
source: Duration: %@
zh_hans: 已持续 %@
zh_hant: 已持續 %@

# status.in.progress
source: In Progress
zh_hans: 进行中
zh_hant: 進行中

# status.ended
source: Ended
zh_hans: 已结束
zh_hant: 已結束

# alert.delete.attack.title
source: Delete Attack Record?
zh_hans: 删除发作记录？
zh_hant: 刪除發作記錄？

# alert.delete.attack.message
source: Are you sure you want to delete this attack record? This action cannot be undone.
zh_hans: 确定要删除这条发作记录吗？此操作不可撤销。
zh_hant: 確定要刪除這條發作記錄嗎？此操作不可撤銷。

# alert.delete.health.event.message
source: Are you sure you want to delete this health event? This action cannot be undone.
zh_hans: 确定要删除这条健康事件吗？此操作不可撤销。
zh_hant: 確定要刪除這條健康事件嗎？此操作不可撤銷。

# alert.cancel.unsaved
source: Unsaved changes will be lost
zh_hans: 取消后将不会保存任何信息
zh_hant: 取消後將不會保存任何信息

# search.placeholder
source: Search symptoms, triggers, medications
zh_hans: 搜索症状、诱因或用药
zh_hant: 搜索症狀、誘因或用藥

# label.default
source: Default
zh_hans: 默认
zh_hant: 默認

# loading.please.wait
source: Please wait
zh_hans: 请稍候
zh_hant: 請稍候

# action.abandon.record
source: Abandon Record
zh_hans: 放弃记录
zh_hant: 放棄記錄

# form.aura.type
source: Aura Type
zh_hans: 先兆类型
zh_hant: 先兆類型

# form.symptoms.western
source: Symptoms
zh_hans: 伴随症状
zh_hant: 伴隨症狀

# calendar.today
source: Today
zh_hans: 今天
zh_hant: 今天

# calendar.no.attack
source: No attack records on this day
zh_hans: 当天无发作记录
zh_hant: 當天無發作記錄

# calendar.attack.record
source: Attack Records
zh_hans: 发作记录
zh_hant: 發作記錄

# calendar.title
source: Calendar
zh_hans: 日历
zh_hant: 日曆

# calendar.weekday.sun
source: S
zh_hans: 日
zh_hant: 日

# calendar.weekday.mon
source: M
zh_hans: 一
zh_hant: 一

# calendar.weekday.tue
source: T
zh_hans: 二
zh_hant: 二

# calendar.weekday.wed
source: W
zh_hans: 三
zh_hant: 三

# calendar.weekday.thu
source: T
zh_hans: 四
zh_hant: 四

# calendar.weekday.fri
source: F
zh_hans: 五
zh_hant: 五

# calendar.weekday.sat
source: S
zh_hans: 六
zh_hant: 六

# calendar.health.event
source: Health Events
zh_hans: 健康事件
zh_hant: 健康事件

# calendar.no.attack.today
source: No attacks recorded today
zh_hans: 当天无发作记录
zh_hant: 當天無發作記錄

# calendar.attack.records
source: Attack Records
zh_hans: 发作记录
zh_hant: 發作記錄

# stats.monthly.title
source: Monthly Statistics
zh_hans: 本月统计
zh_hant: 本月統計

# stats.attack.days
source: Attack Days
zh_hans: 发作天数
zh_hant: 發作天數

# stats.attack.count
source: Attack Count
zh_hans: 发作次数
zh_hant: 發作次數

# stats.avg.duration
source: Avg Duration
zh_hans: 平均持续时长
zh_hant: 平均持續時長

# stats.avg.intensity
source: Avg intensity
zh_hans: 平均强度
zh_hant: 平均強度

# stats.acute.days
source: Acute Med Days
zh_hans: 急性用药天数
zh_hant: 急性用藥天數

# stats.acute.count
source: Acute Med Count
zh_hans: 急性用药次数
zh_hant: 急性用藥次數

# stats.preventive.days
source: Preventive days
zh_hans: 预防性用药天数
zh_hant: 預防性用藥天數

# stats.preventive.count
source: Preventive meds
zh_hans: 预防性用药次数
zh_hant: 預防性用藥次數

# stats.tcm.count
source: TCM treatments
zh_hans: 中医治疗次数
zh_hant: 中醫治療次數

# stats.surgery.count
source: Surgeries
zh_hans: 手术次数
zh_hant: 手術次數

# moh.reminder
source: Medication Reminder
zh_hans: 用药提醒
zh_hant: 用藥提醒

# moh.risk.medium
source: Medium MOH Risk
zh_hans: MOH中度风险
zh_hant: MOH中度風險

# moh.risk.high
source: High MOH Risk
zh_hans: MOH高度风险
zh_hant: MOH高度風險

# moh.msg.low
source: High medication frequency this month, please monitor usage
zh_hans: 本月用药频次较高，请注意用药规律
zh_hant: 本月用藥頻次較高，請注意用藥規律

# moh.msg.medium
source: Medication days approaching MOH threshold, consult doctor
zh_hans: 用药天数接近MOH阈值，建议咨询医生
zh_hant: 用藥天數接近MOH閾值，建議諮詢醫生

# moh.msg.high
source: Medication days exceeded MOH threshold, strongly recommend seeing doctor
zh_hans: 用药天数超过MOH阈值，强烈建议就医
zh_hant: 用藥天數超過MOH閾值，強烈建議就醫

# status.duration
source: Duration
zh_hans: 持续
zh_hant: 持續

# record.detail.title
source: Record Details
zh_hans: 记录详情
zh_hant: 記錄詳情

# alert.delete.record
source: Delete Record
zh_hans: 删除记录
zh_hant: 刪除記錄

# alert.delete.confirm
source: Are you sure you want to delete this record? This cannot be undone.
zh_hans: 确定要删除这条记录吗？此操作无法撤销。
zh_hant: 確定要刪除這條記錄嗎？此操作無法撤銷。

# form.duration
source: Duration
zh_hans: 持续时间
zh_hant: 持續時間

# form.time.info
source: Time Info
zh_hans: 时间信息
zh_hant: 時間信息

# form.status
source: Status
zh_hans: 状态
zh_hant: 狀態

# form.pain.detail
source: Pain Details
zh_hans: 疼痛详情
zh_hant: 疼痛詳情

# detail.symptoms.aura
source: Symptoms & Aura
zh_hans: 症状与先兆
zh_hant: 症狀與先兆

# detail.has.aura
source: Has aura
zh_hans: 有先兆
zh_hant: 有先兆

# detail.triggers
source: Possible Triggers
zh_hans: 可能诱因
zh_hant: 可能誘因

# detail.medication.logs
source: Medication Logs
zh_hans: 用药记录
zh_hant: 用藥記錄

# detail.non.pharm
source: Non-Pharmacological Interventions
zh_hans: 非药物干预
zh_hant: 非藥物干預

# weather.status
source: Weather
zh_hans: 天气状况
zh_hant: 天氣狀況

# weather.risk
source: Risk
zh_hans: 风险
zh_hant: 風險

# weather.risk.high
source: High
zh_hans: 高
zh_hant: 高

# weather.risk.low
source: Low
zh_hans: 低
zh_hant: 低

# alert.environment.risk
source: ⚠️ Environment Risk Alert
zh_hans: ⚠️ 环境风险提示
zh_hant: ⚠️ 環境風險提示

# form.uncategorized
source: Uncategorized
zh_hans: 未分类
zh_hant: 未分類

# form.duration.hour
source: h
zh_hans: 小时
zh_hant: 小時

# form.duration.minute
source: min
zh_hans: 分钟
zh_hant: 分鐘

# analytics.view.chart
source: Charts
zh_hans: 图表
zh_hant: 圖表

# analytics.view.data
source: Data View
zh_hans: 数据视图
zh_hant: 數據視圖

# analytics.empty.record.3
source: Record 3+ attacks
zh_hans: 记录3次以上
zh_hant: 記錄3次以上

# analytics.empty.unlock
source: Unlock analytics
zh_hans: 解锁数据统计
zh_hant: 解鎖數據統計

# analytics.empty.hint
source: Record more data for complete statistics
zh_hans: 记录更多数据，获得更完整的统计信息
zh_hant: 記錄更多數據，獲得更完整的統計信息

# analytics.overview
source: Overview
zh_hans: 整体概况
zh_hant: 整體概況

# analytics.export.failed
source: Export Failed
zh_hans: 导出失败
zh_hant: 導出失敗

# analytics.monthly.trend
source: Monthly Trend
zh_hans: 月度趋势
zh_hant: 月度趨勢

# analytics.data.insufficient
source: Insufficient data
zh_hans: 数据不足
zh_hant: 數據不足

# analytics.trigger.freq
source: Trigger Frequency
zh_hans: 诱因频次统计
zh_hant: 誘因頻次統計

# analytics.no.trigger.data
source: No trigger data
zh_hans: 暂无诱因数据
zh_hant: 暫無誘因數據

# analytics.attack.time.dist
source: Attack Time Distribution
zh_hans: 发作时间分布
zh_hant: 發作時間分佈

# analytics.peak.hour
source: Peak: %d-%d
zh_hans: 高发时段：%d时-%d时
zh_hant: 高發時段：%d時-%d時

# analytics.pain.assessment
source: Pain Assessment
zh_hans: 疼痛评估统计
zh_hant: 疼痛評估統計

# analytics.pain.intensity.dist
source: Pain Intensity Distribution
zh_hans: 疼痛强度分布
zh_hant: 疼痛強度分佈

# analytics.pain.mild
source: Mild (1-3)
zh_hans: 轻度 (1-3)
zh_hant: 輕度 (1-3)

# analytics.pain.moderate
source: Moderate (4-6)
zh_hans: 中度 (4-6)
zh_hant: 中度 (4-6)

# analytics.pain.severe
source: Severe (7-10)
zh_hans: 重度 (7-10)
zh_hant: 重度 (7-10)

# analytics.no.data
source: No data
zh_hans: 暂无数据
zh_hant: 暫無數據

# analytics.pain.location.freq
source: Pain Location (Top 5)
zh_hans: 疼痛部位频次 (Top 5)
zh_hant: 疼痛部位頻次 (Top 5)

# analytics.pain.quality.freq
source: Pain Quality
zh_hans: 疼痛性质频次
zh_hant: 疼痛性質頻次

# analytics.symptom.stats
source: Symptom Stats
zh_hans: 症状统计
zh_hant: 症狀統計

# analytics.symptom.freq
source: Symptom Frequency
zh_hans: 伴随症状频次
zh_hant: 伴隨症狀頻次

# analytics.no.symptom.data
source: No symptom data
zh_hans: 暂无症状数据
zh_hant: 暫無症狀數據

# analytics.aura.stats
source: Aura Stats
zh_hans: 先兆统计
zh_hant: 先兆統計

# analytics.aura.attacks
source: Attacks with aura
zh_hans: 有先兆发作
zh_hant: 有先兆發作

# analytics.medication.stats
source: Medication Stats
zh_hans: 用药统计
zh_hant: 用藥統計

# analytics.acute.medication
source: Acute (during attack)
zh_hans: 急性用药（发作期间）
zh_hant: 急性用藥（發作期間）

# analytics.medication.count
source: Medication uses
zh_hans: 用药次数
zh_hant: 用藥次數

# analytics.medication.days
source: Medication days
zh_hans: 用药天数
zh_hant: 用藥天數

# analytics.no.acute.med
source: No acute medication recorded
zh_hans: 暂无急性用药记录
zh_hant: 暫無急性用藥記錄

# analytics.daily.medication
source: Daily medication
zh_hans: 日常用药
zh_hant: 日常用藥

# analytics.no.daily.med
source: No daily medication recorded
zh_hans: 暂无日常用药记录
zh_hant: 暫無日常用藥記錄

# analytics.no.medication.data
source: No medication data
zh_hans: 暂无用药数据
zh_hant: 暫無用藥數據

# analytics.health.event.stats
source: Health Event Stats
zh_hans: 健康事件统计
zh_hant: 健康事件統計

# analytics.avg.treatment.duration
source: Avg treatment duration
zh_hans: 平均治疗时长
zh_hant: 平均治療時長

# analytics.tcm.detail
source: TCM Treatment Details
zh_hans: 中医治疗详情
zh_hant: 中醫治療詳情

# analytics.tcm.title
source: TCM Treatment Stats
zh_hans: 中医治疗统计
zh_hant: 中醫治療統計

# analytics.tcm.total.treatments
source: Total treatments
zh_hans: 总治疗次数
zh_hant: 總治療次數

# analytics.tcm.count.suffix
source: times
zh_hans: 次
zh_hant: 次

# analytics.tcm.avg.duration
source: Avg treatment duration
zh_hans: 平均治疗时长
zh_hant: 平均治療時長

# analytics.treatment.minute.suffix
source: min
zh_hans: 分钟
zh_hant: 分鐘

# analytics.tcm.type.distribution
source: Treatment type distribution
zh_hans: 治疗类型分布
zh_hant: 治療類型分佈

# analytics.tcm.no.records
source: No TCM treatment records
zh_hans: 暂无中医治疗记录
zh_hant: 暫無中醫治療記錄

# analytics.effectiveness.title
source: Treatment Effectiveness
zh_hans: 治疗效果分析
zh_hant: 治療效果分析

# analytics.effectiveness.after.medication
source: After starting daily medication
zh_hans: 开始日常用药治疗后
zh_hant: 開始日常用藥治療後

# analytics.effectiveness.before.30days
source: 30 days before
zh_hans: 治疗前30天
zh_hant: 治療前30天

# analytics.effectiveness.attack.days.suffix
source: attack days
zh_hans: 天发作
zh_hant: 天發作

# analytics.effectiveness.after.30days
source: 30 days after
zh_hans: 治疗后30天
zh_hant: 治療後30天

# analytics.effectiveness.reduction.format
source: Attack days reduced by %d days
zh_hans: 发作天数减少 %d 天
zh_hant: 發作天數減少 %d 天

# analytics.effectiveness.after.tcm
source: After starting TCM treatment
zh_hans: 开始中医治疗后
zh_hant: 開始中醫治療後

# analytics.surgery.record
source: Surgery Records
zh_hans: 手术记录
zh_hant: 手術記錄

# analytics.moh.reminder.title
source: Medication Reminder
zh_hans: 用药频次提醒
zh_hant: 用藥頻次提醒

# analytics.moh.range.monthly
source: Monthly avg acute med days
zh_hans: 月均急性用药天数
zh_hant: 月均急性用藥天數

# analytics.moh.range.this.month
source: This month acute med days
zh_hans: 本月急性用药天数
zh_hant: 本月急性用藥天數

# analytics.moh.threshold.monthly
source: Recommended ≤10 days/month
zh_hans: 建议不超过 10 天/月
zh_hant: 建議不超過 10 天/月

# analytics.moh.threshold.this.month
source: Recommended ≤10 days
zh_hans: 建议不超过 10 天
zh_hant: 建議不超過 10 天

# analytics.moh.warning.multi
source: Monthly avg ≥10 days, consult doctor
zh_hans: 月均用药天数已达到或超过10天，建议就医咨询专业医生
zh_hant: 月均用藥天數已達到或超過10天，建議就醫諮詢專業醫生

# analytics.moh.warning.single
source: This month ≥10 days, consult doctor
zh_hans: 当月用药天数已达到或超过10天，建议就医咨询专业医生
zh_hant: 當月用藥天數已達到或超過10天，建議就醫諮詢專業醫生

# form.unit.day
source: days
zh_hans: 天
zh_hant: 天

# form.unit.count
source: times
zh_hans: 次
zh_hant: 次

# form.unit.minutes
source: min
zh_hans: 分钟
zh_hant: 分鐘

# time.range.this.month
source: This month
zh_hans: 本月
zh_hant: 本月

# time.range.3months
source: Last 3 months
zh_hans: 近3个月
zh_hant: 近3個月

# time.range.6months
source: Last 6 months
zh_hans: 近6个月
zh_hant: 近6個月

# time.range.1year
source: Last year
zh_hans: 近1年
zh_hant: 近1年

# time.range.custom
source: Custom
zh_hans: 自定义
zh_hant: 自定義

# filter.time.range
source: Time Range
zh_hans: 时间范围
zh_hant: 時間範圍

# filter.title
source: Filter & Sort
zh_hans: 筛选和排序
zh_hant: 篩選和排序

# form.start.date
source: Start Date
zh_hans: 开始日期
zh_hant: 開始日期

# form.end.date
source: End Date
zh_hans: 結束日期
zh_hant: 結束日期

# calendar.pain.legend
source: Pain Intensity Legend
zh_hans: 疼痛强度图例
zh_hant: 疼痛強度圖例

# calendar.event.legend
source: Health Event Legend
zh_hans: 健康事件图例
zh_hant: 健康事件圖例

# analytics.pain.mild.short
source: Mild
zh_hans: 轻度
zh_hant: 輕度

# analytics.pain.moderate.short
source: Moderate
zh_hans: 中度
zh_hant: 中度

# analytics.pain.severe.short
source: Severe
zh_hans: 重度
zh_hant: 重度

# profile.reset.all.data
source: Reset All Data
zh_hans: 重置所有数据
zh_hant: 重置所有數據

# profile.reset.confirm.placeholder
source: Type delete to confirm
zh_hans: 请输入 delete 确认
zh_hant: 請輸入 delete 確認

# profile.confirm.reset
source: Confirm Reset
zh_hans: 确认重置
zh_hant: 確認重置

# profile.reset.confirm.message
source: This will delete all attack records, medications, health events, and custom labels. Default labels will be restored. Type delete to confirm.
zh_hans: 此操作将删除所有发作记录、药物数据、健康事件和自定义标签，但会保留默认标签等初始化信息。 请输入 delete 确认此操作。
zh_hant: 此操作將刪除所有發作記錄、藥物數據、健康事件和自定義標籤，但會保留默認標籤等初始化信息。 請輸入 delete 確認此操作。

# profile.data.reset.success
source: Data Reset
zh_hans: 数据已重置
zh_hant: 數據已重置

# profile.data.reset.message
source: Data has been reset. Default labels restored.
zh_hans: 数据已重置，默认标签已恢复。
zh_hant: 數據已重置，默認標籤已恢復。

# profile.premium
source: Premium
zh_hans: 高级版
zh_hant: 高級版
